
;; -- Namespace ---------------------------------------------------------------
;; ----------------------------------------------------------------------------

(ns x.mid-dictionary.books.website)



;; ----------------------------------------------------------------------------
;; ----------------------------------------------------------------------------

; @constant (map)
(def BOOK {:home-page
           {:en "Home"
            :hu "Kezdőlap"}
           :logo
           {:en "Logo"
            :hu "Logó"}
           :website
           {:en "Website"
            :hu "Webhely"}
           :website-menu
           {:en "Website menu"
            :hu "Webhely"}})
